/*

 @name    : 锅巴汉化 - Web汉化插件
 @author  : 麦子、JAR、小蓝、好阳光的小锅巴
 @version : V0.6.1 - 2019-07-09
 @website : http://www.g8hh.com

*/

//1.汉化杂项
var cnItems = {
    _OTHER_: [],

    //未分类：
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",

}


//需处理的前缀
var cnPrefix = {
    "(-": "(-",
    "(+": "(+",
    "(": "(",
    "-": "-",
    "+": "+",
    " ": " ",
    ": ": "： ",
    "\n": "",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
}

//需处理的后缀
var cnPostfix = {
    ":": "：",
    "：": "：",
    ": ": "： ",
    "： ": "： ",
    "/s)": "/s)",
    "/s": "/s",
    ")": ")",
    "%": "%",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": " ",
    "\n": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
}

//需排除的，正则匹配
var cnExcludeWhole = [
    /^(\d+)$/,
    /^([\d\.]+)e(\d+)$/,
    /^([\d\.]+)$/,
    /^([\d\.,]+)$\$/,
	/^([\d\.,]+)$/,
    /^([\d\.]+)e([\d\.,]+)$/,

];
var cnExcludePostfix = [
]

//正则替换，带数字的固定格式句子
//纯数字：(\d+)
//逗号：([\d\.,]+)
//小数点：([\d\.]+)
//原样输出的字段：(.+)
//换行加空格：\n(.+)
var cnRegReplace = new Map([
	[/^Cost: (\d+) torch/, '成本：$1 火把'],
	[/^Cost: ([\d\.,]+) wood/, '成本：$1 原木'],
	[/^Cost: (\d+) stone/, '成本：$1 圆石'],
	[/^Cost: ([\d\.,]+) coal/, '成本：$1 煤炭'],
	[/^Cost: ([\d\.,]+) blood magic/, '成本：$1 血魔法'],
	[/^Cost: ([\d\.,]+) blood/, '成本：$1 血'],
	[/^cost:([\d\.,]+)/, '成本:$1'],
	[/^Cost: (\d+) copper/, '成本：$1 铜'],
	[/^Cost: (\d+) \$/, '成本：$1 $'],
	[/^Cost: ([\d\.,]+) \iron/, '成本：$1 铁'],
	[/^Next at ([\d\.,]+) copper/, '下一个 $1 铜'],
	[/^Next at ([\d\.,]+) time/, '下一个 $1 时间'],
	[/^Next at ([\d\.,]+) wood/, '下一个 $1 木头'],
	[/^Next at ([\d\.,]+) stone/, '下一个 $1 圆石'],
	[/^You have ([\d\.,]+) time/, '你有 $1 时间'],
	[/^You have ([\d\.,]+) wood/, '你有 $1 木头'],
	[/^You have ([\d\.,]+) ATK/, '你有 $1 攻击力'],
	[/^You have ([\d\.,]+) torch/, '你有 $1 火把'],
	[/^You have ([\d\.,]+) stone/, '你有 $1 圆石'],
	[/^You have ([\d\.,]+) blood magic/, '你有 $1 血魔法'],
	[/^You have ([\d\.,]+) blood/, '你有 $1 血'],
	[/^You have ([\d\.,]+) depth/, '你有 $1 深度'],
	[/^You get ([\d\.,]+)\/sec/, '你每秒获得 $1'],
	[/^Req: ([\d\.,]+) \/ ([\d\.,]+) stone/, '需求: $1 / $2 圆石'],
	[/^Dev Speed: ([\d\.,]+)x/, '时间加速$1x'],
	[/^Reach ([\d\.,]+) blood to unlock \(\You have ([\d\.,]+) blood/, '到达 $1 血以解锁(你有 $2 血'],
]); 
